# -*- coding: utf-8 -*-

from aiogram.utils.markdown import escape_md
from app import __version__

long_messages = {

    "start": " 👋 Вітаю в нашій когорті, хлопче/дівчино!\n"
             "Цей ботик допоможе тобі файно провести вільний час, граючись із розмірами твоїх ягідок. "
             "Скоріше приймай участь, buddy, та не зволікай, пиши /ass",

    "help": "Не бійсь, ось усі команди:\n----------------------\n"
             "     🍑  /ass — почати гру\n"
             "     🎰 /luck — казино\n"
             "     ❔  /help — ця довідка\n"
             "     🚶‍♂️  /leave — покинути гру\n"
             "      🙋‍♂️ /r повністю видали російську мову — повідомити про недолік або ідею\n"
             "     📊 /statistic — рейтинг гравців\n\n"
            "👨‍💻 /about — про розробника\n"
            "----------------------",

    "admin": "Режим баті:\n----------------------\n"
             "Замість аргументів можна використовувати параметр 'self'\n"
             "    /bl group_id — показати заблокованих гравців\n"
             "    /ub group_id user_id — розбанити гравця\n"
             "    /ban group_id user_id — забанити покидька\n"
             "    /show group_id — список гравція за групою\n"
             "    /reports — показати звіти\n"
             "    /dreports — показати детальні звіти\n"
             "    /groups — показати усі групи\n"
             "    /clear — видалити усі звіти\n"
             "    /notify — віправити повідомлення группам\n"
             "----------------------",

    "links": {
        "github": "https://github.com/fecton",
        "telegram_channel": "https://t.me/varlife",
        "text": "AssBot v%s GNU Licence 2022" % __version__,
        },

    "spam": ", я тобі попку збільшую, а ти мені спамиш. "
            "Мені взагалі-то теж не солодко постійно вам попу міряти. "
            "Все, дружок, тепер ти мене не будеш зайобувати — ти в муті.",

    "errors": {
        "not_registered": "Ти не зарегестрований у грі!",
        "no_players": "Ще нема гравців! Стань першим!",
        "no_group": "Ще нема груп!",
        "no_users": "Нема користувачів!",
        "unknown_group": "Невідома група!",
        "unknown_user": "Невідомий користувач!",
        "illegal_format": "Невірний формат!",
    },

    "notify": {
        "enter_message": "😇 Будь ласка, введіть деяку новину одним повідомленням",
        "are_you_sure": "Ви впевнені у своєму повідомленні? y/n (так/ні)",
        "success": "Повідомлення було відправлене группам!",
        "cancel": "Процедура скасована!",
    },

    "luck": {
        "tiny_ass": "Йоу, дружок, твоя дупця ще не достатньо величезна, гайда після 100 см",
    },

    "leave": {
        "nope": "Ні, дружок, таке не проканає 😏",
        "so_sad": "Ти покинув гру! Шкода такий гарний зад",
    }

}
