# -*- coding: utf-8 -*-
long_messages = {
    "start": " 👋 Вітаю в нашій когорті, хлопче/дівчино!\n"
             "Цей ботик допоможе тобі файно провести вільний час, граючись із розмірами твоїх ягідок. "
             "Скоріше приймай участь, buddy, та не зволікай, пиши /ass",
    "help": "Не бійсь, ось усі команди:\n----------------------\n"
             "     🍑  /ass — почати гру\n"
             "     🎰 /luck — випробувати удачу "
             "(виграш у розмірі 200% та програш 50%)\n"
             "     ❔  /help — ця довідка\n"
             "     🚶‍♂️  /leave — покинути гру\n"
             "      🙋‍♂️ /r ваш детальний звіт — повідомити про недолік\n"
             "     📊 /statistic — рейтинг гравців\n\n"
            "👨‍💻 /about — про розробника\n"
            "----------------------",
    "admin": "Режим баті:\n----------------------\n"
             "Замість аргументів можна використовувати параметр 'self'\n"
             "    /bl group_id — виводить заблокованих гравців\n"
             "    /ub group_id user_id — видаляє користувача з бану\n"
             "    /ban group_id user_id — заблокувати користувача\n"
             "    /show group_id — побачити список\n"
             "    /reports — побачити звіти користувачів\n"
             "    /dreports — побачити звіти користувачів (повна форма)\n"
             "    /groups — побачити усі групи\n"
             "    /clear — очищує звіти\n",
    "links": {
        "github" : "https://github.com/fecton",
        "telegram_channel" : "https://t.me/varlife",
        "text" : "AssBot v1.5 GNU Licence 2021",
        },
    "spam": ", я тобі попку збільшую, а ти мені спамиш. "
             "Мені взагалі-то теж не солодко постійно вам попу міряти. "
             "Все, дружок, тепер ти мене не будеш зайобувати — ти в муті."
}
